Configuration_project_01/src/DataProcessors/АЭС_ЗагрузкаКонтрагентов/АЭС_ЗагрузкаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>АЭС_ЗагрузкаКонтрагентов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Патрнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

Configuration_project_01/src/InformationRegisters/АЭС_ДанныеКонтрагентов/АЭС_ДанныеКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АЭС_ДанныеКонтрагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПризнакОплатыПоСчетчику</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоследниеПоказания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнейОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Задолженность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Начислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Configuration_project_01/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдДоговораЮЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Configuration_project_01/src/DataProcessors/АЭС_ЗагрузкаКонтрагентов/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл";

	ДиалогВыбора.ПолноеИмяФайла = "";
    Текст = "ru = ""Текст""; en = ""Text""";
    Фильтр = "ДБФ (*.dbf)|*.dbf";
    ДиалогВыбора.Фильтр = Фильтр;
    ДиалогВыбора.МножественныйВыбор = Ложь;

	Если ДиалогВыбора.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	КС = Новый КвалификаторыСтроки(500);
	КЧ = Новый КвалификаторыЧисла(15,2);
	КД = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);	
	Массив = Новый Массив;                            
	Массив.Добавить(Тип("Строка"));
	ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	Массив.Очистить();
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , КЧ);
	Массив.Очистить();
	Массив.Добавить(Тип("Дата"));
	ОписаниеТиповД = Новый ОписаниеТипов(Массив, , КД);
	Массив.Очистить();
	Массив.Добавить(Тип("Булево"));
	ОписаниеТиповБулево = Новый ОписаниеТипов(Массив);
	Массив.Очистить();
	Массив.Добавить(Тип("СправочникСсылка.Партнеры"));
	ОписаниеТиповПартнер = Новый ОписаниеТипов(Массив);
	
	ТЗ = Новый ТаблицаЗначений;	
	ТЗ.Колонки.Добавить("Партнер", ОписаниеТиповПартнер);
	ТЗ.Колонки.Добавить("ЛС", ОписаниеТиповС);
	ТЗ.Колонки.Добавить("ФИО", ОписаниеТиповС);
	ТЗ.Колонки.Добавить("Адрес", ОписаниеТиповС);
	ТЗ.Колонки.Добавить("ПризнакОплатыПоСчетчику", ОписаниеТиповБулево);
	ТЗ.Колонки.Добавить("ПоследниеПоказания", ОписаниеТиповЧ);
	ТЗ.Колонки.Добавить("ДатаПоследнейОплаты", ОписаниеТиповД);
	ТЗ.Колонки.Добавить("Задолженность", ОписаниеТиповЧ);
	ТЗ.Колонки.Добавить("Начислено", ОписаниеТиповЧ);

	ФайлДБФ = Новый XBase;
	ФайлДБФ.Кодировка = КодировкаXBase.OEM;
	ФайлДБФ.ОткрытьФайл(Объект.ПутьКФайлу);
	ФайлДБФ.Первая();
	
	Пока Не ФайлДБФ.ВКонце() Цикл
		СтруктураДанных = ТЗ.Добавить();
		СтруктураДанных.Партнер					= Объект.Патрнер;
		СтруктураДанных.ЛС						= ФайлДБФ.LSHET;
		СтруктураДанных.ФИО 					= ФайлДБФ.FIO;
		СтруктураДанных.Адрес 					= ФайлДБФ.ADRES;
		СтруктураДанных.ПризнакОплатыПоСчетчику	= ФайлДБФ.PR_STH;
		СтруктураДанных.ПоследниеПоказания		= ФайлДБФ.LAST_P;
		СтруктураДанных.ДатаПоследнейОплаты		= ФайлДБФ.DATE_P;
		СтруктураДанных.Задолженность			= ФайлДБФ.SUMMA;
		СтруктураДанных.Начислено				= ФайлДБФ.TEKSUMMA;
		ФайлДБФ.Следующая();
	КонецЦикла;
	ФайлДБФ.ЗакрытьФайл();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Партнер,
	               |	Контрагенты.ЛС,
	               |	Контрагенты.ФИО,
	               |	Контрагенты.Адрес,
	               |	Контрагенты.ПризнакОплатыПоСчетчику,
	               |	Контрагенты.ПоследниеПоказания,
	               |	Контрагенты.ДатаПоследнейОплаты,
	               |	Контрагенты.Задолженность,
	               |	Контрагенты.Начислено
	               |ПОМЕСТИТЬ ВТ_Список
	               |ИЗ
	               |	&МассивДанных КАК Контрагенты
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	ВТ_Список.Партнер,
	               |	ВТ_Список.ЛС,
	               |	ВТ_Список.ФИО,
	               |	ВТ_Список.Адрес,
	               |	ВТ_Список.ПризнакОплатыПоСчетчику,
	               |	ВТ_Список.ПоследниеПоказания,
	               |	ВТ_Список.ДатаПоследнейОплаты,
	               |	ВТ_Список.Задолженность,
	               |	ВТ_Список.Начислено
	               |ИЗ
	               |	ВТ_Список КАК ВТ_Список
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	               |		ПО ВТ_Список.Партнер = Контрагенты.Партнер
	               |			И ВТ_Список.ЛС = Контрагенты.НомерЛС";
	
	Запрос.УстановитьПараметр("МассивДанных", ТЗ);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Контрагент = null Тогда
			Контрагент							= Справочники.Контрагенты.СоздатьЭлемент();
			Контрагент.ЮрФизЛицо 				= Перечисления.ЮрФизЛицо.ФизЛицо;
			Контрагент.Партнер					= Выборка.Партнер;
			Контрагент.НомерЛС					= Выборка.ЛС;
			Контрагент.Наименование				= Выборка.ФИО;
			Контрагент.НаименованиеПолное		= Выборка.ФИО;
			Контрагент.АдресЛС					= Выборка.Адрес;
			КонтактнаяИнформация				= Контрагент.КонтактнаяИнформация.Добавить();
			КонтактнаяИнформация.Тип			= Перечисления.ТипыКонтактнойИнформации.Адрес;
			КонтактнаяИнформация.Вид			= Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			КонтактнаяИнформация.Представление	= Выборка.Адрес;
			Контрагент.Записать();
		Иначе
			Контрагент = Выборка.Контрагент;
		КонецЕсли;
	    НаборЗаписей = РегистрыСведений.АЭС_ДанныеКонтрагентов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(Объект.Период);
		НаборЗаписей.Отбор.Контрагент.Установить(Контрагент);
		
		НоваяЗапись							= НаборЗаписей.Добавить();
		НоваяЗапись.Период 					= Объект.Период;
		НоваяЗапись.Контрагент 				= Контрагент;
		НоваяЗапись.ПризнакОплатыПоСчетчику = Выборка.ПризнакОплатыПоСчетчику;
		НоваяЗапись.ПоследниеПоказания		= Выборка.ПоследниеПоказания;
		НоваяЗапись.ДатаПоследнейОплаты		= Выборка.ДатаПоследнейОплаты;
		НоваяЗапись.Задолженность			= Выборка.Задолженность;
		НоваяЗапись.Начислено				= Выборка.Начислено;
		
		НаборЗаписей.Записать(); 
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры
